{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pywistor import Wistor"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'app': '', 'fullAccess': True, 'appgraph': 'http://www.rws.nl/2017/vr/app', 'loggedIn': 'TRUE', 'repo': 'Demo', 'version': '1.05'}\n"
     ]
    }
   ],
   "source": [
    "wistor = Wistor(\"Demo\", \"Demo\", \"Demo\")\n",
    "#wistor.execute_rule('ams_add_many_wkt',{\"triples\":f'(<http://wistor.nl/some_generated_id_1> \"POINT(4.9 52.3)\"^^geo:wktLiteral \"{selected_object_type}\")\\n(<http://wistor.nl/some_generated_id_2> \"POINT(4.8 51.4)\"^^geo:wktLiteral \"{selected_object_type}\")'}, debug_mode=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "selected_object_type = \"pipe\"\n",
    "res = wistor.execute_rule('ams_add_many_wkt',{\"triples\":f'(<http://wistor.nl/some_generated_id_1> \"POINT(4.9 52.3)\"^^geo:wktLiteral \"{selected_object_type}\")'}, debug_mode=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "False"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res['success'] == True"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'debugMessages': [{'level': 'INFO',\n",
       "   'message': 'start rules with tag ams_add_many_wkt',\n",
       "   'mdc': {'Repo': 'Demo',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172'},\n",
       "   'timestamp': '2025-03-18T15:42:19.524'},\n",
       "  {'level': 'INFO',\n",
       "   'message': '\\n#start sparql select\\n\\tPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \\n select distinct ?a \\n where   {   ?a a/rdfs:subClassOf* <http://www.bbsgroep.nl/application/v2/Rule> . ?a <http://www.bbsgroep.nl/application/v2/tag> ?tag.  filter (?tag=\"ams_add_many_wkt\") \\t filter not exists {?a <http://www.bbsgroep.nl/application/v2/active> false }\\toptional{?a <http://www.bbsgroep.nl/application/v2/salience> ?sal} } order by DESC(?sal)\\n#end sparql select',\n",
       "   'mdc': {'Method-Name': 'select',\n",
       "    'Rule-Chain-Execution': '<none>',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': '<none>',\n",
       "    ' Query-Id': 'a9ebff89-1b2a-43d2-a4da-4a05aec97d88',\n",
       "    'Start-Date': '2025-03-18T15:42:19.524864767'},\n",
       "   'timestamp': '2025-03-18T15:42:19.525'},\n",
       "  {'level': 'INFO',\n",
       "   'message': 'TAccess select success, row count=unknown',\n",
       "   'mdc': {'Method-Name': 'select',\n",
       "    'Rule-Chain-Execution': '<none>',\n",
       "    'Execution-Time': '0.007 seconds',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': '<none>',\n",
       "    ' Query-Id': 'a9ebff89-1b2a-43d2-a4da-4a05aec97d88',\n",
       "    'End-Date': '2025-03-18T15:42:19.531954334',\n",
       "    'Start-Date': '2025-03-18T15:42:19.524864767'},\n",
       "   'timestamp': '2025-03-18T15:42:19.531'},\n",
       "  {'level': 'INFO',\n",
       "   'message': 'received request to execute rule http://wistor.nl/rules/data#ams_test with props: {\"triples\":\"(<http://wistor.nl/some_generated_id_1> \\\\\"POINT(4.9 52.3)\\\\\"^^geo:wktLiteral)\"}',\n",
       "   'mdc': {'Repo': 'Demo',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172'},\n",
       "   'timestamp': '2025-03-18T15:42:19.532'},\n",
       "  {'level': 'INFO',\n",
       "   'message': '\\n#start sparql select\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX owl:<http://www.w3.org/2002/07/owl#> select distinct ?type  ?label where { <http://wistor.nl/rules/data#ams_test> a/rdfs:subClassOf* ?type. ?type rdfs:subClassOf <http://www.bbsgroep.nl/application/v2/Rule>.<http://wistor.nl/rules/data#ams_test> <http://www.w3.org/2000/01/rdf-schema#label> ?label. }\\n#end sparql select',\n",
       "   'mdc': {'Method-Name': 'select',\n",
       "    'Rule-Chain-Execution': '<none>',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': '<none>',\n",
       "    ' Query-Id': '9d77b5b8-cf5e-434f-8bff-7f4a244aba77',\n",
       "    'Start-Date': '2025-03-18T15:42:19.532180914'},\n",
       "   'timestamp': '2025-03-18T15:42:19.532'},\n",
       "  {'level': 'INFO',\n",
       "   'message': 'TAccess select success, row count=unknown',\n",
       "   'mdc': {'Method-Name': 'select',\n",
       "    'Rule-Chain-Execution': '<none>',\n",
       "    'Execution-Time': '0.003 seconds',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': '<none>',\n",
       "    ' Query-Id': '9d77b5b8-cf5e-434f-8bff-7f4a244aba77',\n",
       "    'End-Date': '2025-03-18T15:42:19.536080871',\n",
       "    'Start-Date': '2025-03-18T15:42:19.532180914'},\n",
       "   'timestamp': '2025-03-18T15:42:19.536'},\n",
       "  {'level': 'INFO',\n",
       "   'message': 'found a simple sparql rule ams_add_many_wkt',\n",
       "   'mdc': {'Repo': 'Demo',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172'},\n",
       "   'timestamp': '2025-03-18T15:42:19.536'},\n",
       "  {'level': 'INFO',\n",
       "   'message': '\\n#start sparql select\\n\\tPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\n\\tselect ?tag where {\\n\\t\\t<http://wistor.nl/rules/data#ams_test> a/rdfs:subClassOf* <http://www.bbsgroep.nl/application/v2/Rule> .\\n\\t\\t<http://wistor.nl/rules/data#ams_test> <http://www.bbsgroep.nl/application/v2/tag> ?tag .\\n\\t}\\n\\n#end sparql select',\n",
       "   'mdc': {'Method-Name': 'select',\n",
       "    'Rule-Chain-Execution': '<none>',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': '<none>',\n",
       "    ' Query-Id': '8da76898-e4d2-4557-a585-ee0dca0312ec',\n",
       "    'Start-Date': '2025-03-18T15:42:19.536352338'},\n",
       "   'timestamp': '2025-03-18T15:42:19.536'},\n",
       "  {'level': 'INFO',\n",
       "   'message': 'TAccess select success, row count=unknown',\n",
       "   'mdc': {'Method-Name': 'select',\n",
       "    'Rule-Chain-Execution': '<none>',\n",
       "    'Execution-Time': '0.003 seconds',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': '<none>',\n",
       "    ' Query-Id': '8da76898-e4d2-4557-a585-ee0dca0312ec',\n",
       "    'End-Date': '2025-03-18T15:42:19.539702029',\n",
       "    'Start-Date': '2025-03-18T15:42:19.536352338'},\n",
       "   'timestamp': '2025-03-18T15:42:19.539'},\n",
       "  {'level': 'INFO',\n",
       "   'message': '\\n#start sparql select\\n\\tPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\n\\n\\tSELECT ?threadPoolUri ?corePoolSize ?maximumPoolSize WHERE {\\n\\t\\t<http://wistor.nl/rules/data#ams_test> a/rdfs:subClassOf* <http://www.bbsgroep.nl/application/v2/Rule> .\\n\\t\\t<http://wistor.nl/rules/data#ams_test> <http://www.bbsgroep.nl/application/v2/threadPool> ?threadPoolUri .\\n\\n\\t\\t?threadPoolUri a/rdfs:subClassOf* <http://www.bbsgroep.nl/application/v2/ThreadPool> .\\n\\t\\tOPTIONAL {\\n\\t\\t\\t?threadPoolUri <http://www.bbsgroep.nl/application/v2/corePoolSize> ?corePoolSize .\\n\\t\\t\\t?threadPoolUri <http://www.bbsgroep.nl/application/v2/maximumPoolSize> ?maximumPoolSize .\\n\\t\\t}\\n\\t}\\n\\n#end sparql select',\n",
       "   'mdc': {'Method-Name': 'select',\n",
       "    'Rule-Chain-Execution': '<none>',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': '<none>',\n",
       "    ' Query-Id': '63f5a669-12da-4f37-8201-cb3b1f4ea7c9',\n",
       "    'Start-Date': '2025-03-18T15:42:19.539961959'},\n",
       "   'timestamp': '2025-03-18T15:42:19.54'},\n",
       "  {'level': 'INFO',\n",
       "   'message': 'TAccess select success, row count=unknown',\n",
       "   'mdc': {'Method-Name': 'select',\n",
       "    'Rule-Chain-Execution': '<none>',\n",
       "    'Execution-Time': '0.003 seconds',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': '<none>',\n",
       "    ' Query-Id': '63f5a669-12da-4f37-8201-cb3b1f4ea7c9',\n",
       "    'End-Date': '2025-03-18T15:42:19.543948396',\n",
       "    'Start-Date': '2025-03-18T15:42:19.539961959'},\n",
       "   'timestamp': '2025-03-18T15:42:19.543'},\n",
       "  {'level': 'INFO',\n",
       "   'message': '\\n#start sparql select\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX owl:<http://www.w3.org/2002/07/owl#> select distinct ?sp ?label  where { optional {<http://wistor.nl/rules/data#ams_test> <http://www.w3.org/2000/01/rdf-schema#label> ?label.}optional {<http://wistor.nl/rules/data#ams_test> <http://www.bbsgroep.nl/application/v2/sparqlstring> ?sp}  }\\n#end sparql select',\n",
       "   'mdc': {'Method-Name': 'select',\n",
       "    'Rule-Chain-Execution': '6f055b33-d445-4cab-9577-f365e4c90a31',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': 'ams_add_many_wkt',\n",
       "    ' Query-Id': '62ff5927-5d83-444b-8cbb-161776fdb69e',\n",
       "    'Start-Date': '2025-03-18T15:42:19.544068737'},\n",
       "   'timestamp': '2025-03-18T15:42:19.544'},\n",
       "  {'level': 'INFO',\n",
       "   'message': 'TAccess select success, row count=unknown',\n",
       "   'mdc': {'Method-Name': 'select',\n",
       "    'Rule-Chain-Execution': '6f055b33-d445-4cab-9577-f365e4c90a31',\n",
       "    'Execution-Time': '0.003 seconds',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': 'ams_add_many_wkt',\n",
       "    ' Query-Id': '62ff5927-5d83-444b-8cbb-161776fdb69e',\n",
       "    'End-Date': '2025-03-18T15:42:19.547255432',\n",
       "    'Start-Date': '2025-03-18T15:42:19.544068737'},\n",
       "   'timestamp': '2025-03-18T15:42:19.547'},\n",
       "  {'level': 'INFO',\n",
       "   'message': 'converted sparql query: PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX wistor: <http://wistor.nl>\\nINSERT\\n{\\n  GRAPH <http://wistor.nl/ams/wkt>\\n  {\\n    ?uri geo:asWKT ?wkt;\\n    \\t rdf:type  ?type\\n  }\\n}\\nWHERE\\n{\\n  VALUES (?uri ?wkt ?type) { (<http://wistor.nl/some_generated_id_1> \"POINT(4.9 52.3)\"^^geo:wktLiteral) }\\n}',\n",
       "   'mdc': {'Repo': 'Demo',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172'},\n",
       "   'timestamp': '2025-03-18T15:42:19.547'},\n",
       "  {'level': 'INFO',\n",
       "   'message': '\\n#start sparql update\\nPREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX wistor: <http://wistor.nl>\\nINSERT\\n{\\n  GRAPH <http://wistor.nl/ams/wkt>\\n  {\\n    ?uri geo:asWKT ?wkt;\\n    \\t rdf:type  ?type\\n  }\\n}\\nWHERE\\n{\\n  VALUES (?uri ?wkt ?type) { (<http://wistor.nl/some_generated_id_1> \"POINT(4.9 52.3)\"^^geo:wktLiteral) }\\n}\\n#end sparql update',\n",
       "   'mdc': {'Method-Name': 'insert',\n",
       "    'Rule-Chain-Execution': '6f055b33-d445-4cab-9577-f365e4c90a31',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': 'ams_add_many_wkt',\n",
       "    ' Query-Id': 'f998c465-b4e2-4e05-a20e-153e84601372',\n",
       "    'Start-Date': '2025-03-18T15:42:19.547466498'},\n",
       "   'timestamp': '2025-03-18T15:42:19.547'},\n",
       "  {'level': 'WARN',\n",
       "   'message': 'Server reports problem: MALFORMED QUERY (enable debug logging for full details)',\n",
       "   'mdc': {'Method-Name': 'insert',\n",
       "    'Rule-Chain-Execution': '6f055b33-d445-4cab-9577-f365e4c90a31',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': 'ams_add_many_wkt',\n",
       "    ' Query-Id': 'f998c465-b4e2-4e05-a20e-153e84601372',\n",
       "    'Start-Date': '2025-03-18T15:42:19.547466498'},\n",
       "   'timestamp': '2025-03-18T15:42:19.552'},\n",
       "  {'level': 'WARN',\n",
       "   'message': 'Server reports problem: MALFORMED QUERY (enable debug logging for full details)',\n",
       "   'mdc': {'Method-Name': 'insert',\n",
       "    'Rule-Chain-Execution': '6f055b33-d445-4cab-9577-f365e4c90a31',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': 'ams_add_many_wkt',\n",
       "    ' Query-Id': 'f998c465-b4e2-4e05-a20e-153e84601372',\n",
       "    'Start-Date': '2025-03-18T15:42:19.547466498'},\n",
       "   'timestamp': '2025-03-18T15:42:19.557'},\n",
       "  {'level': 'WARN',\n",
       "   'message': 'Server reports problem: MALFORMED QUERY (enable debug logging for full details)',\n",
       "   'mdc': {'Method-Name': 'insert',\n",
       "    'Rule-Chain-Execution': '6f055b33-d445-4cab-9577-f365e4c90a31',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': 'ams_add_many_wkt',\n",
       "    ' Query-Id': 'f998c465-b4e2-4e05-a20e-153e84601372',\n",
       "    'Start-Date': '2025-03-18T15:42:19.547466498'},\n",
       "   'timestamp': '2025-03-18T15:42:19.637'},\n",
       "  {'level': 'INFO',\n",
       "   'message': 'TAccess insert failure',\n",
       "   'mdc': {'Method-Name': 'insert',\n",
       "    'Rule-Chain-Execution': '6f055b33-d445-4cab-9577-f365e4c90a31',\n",
       "    'Execution-Time': '0.09 seconds',\n",
       "    'Repo': 'Demo',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Rule-Chain': 'ams_add_many_wkt',\n",
       "    ' Query-Id': 'f998c465-b4e2-4e05-a20e-153e84601372',\n",
       "    'End-Date': '2025-03-18T15:42:19.63792088',\n",
       "    'Start-Date': '2025-03-18T15:42:19.547466498'},\n",
       "   'timestamp': '2025-03-18T15:42:19.637'},\n",
       "  {'level': 'ERROR',\n",
       "   'message': 'could not execute rule ams_add_many_wkt, sparql insert failed',\n",
       "   'mdc': {'Repo': 'Demo',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172'},\n",
       "   'timestamp': '2025-03-18T15:42:19.638'},\n",
       "  {'level': 'ERROR',\n",
       "   'message': 'could not execute rule \\'ams_add_many_wkt\\'. sp error 22 . PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX wistor: <http://wistor.nl>\\nINSERT\\n{\\n  GRAPH <http://wistor.nl/ams/wkt>\\n  {\\n    ?uri geo:asWKT ?wkt;\\n    \\t rdf:type  ?type\\n  }\\n}\\nWHERE\\n{\\n  VALUES (?uri ?wkt ?type) { (<http://wistor.nl/some_generated_id_1> \"POINT(4.9 52.3)\"^^geo:wktLiteral) }\\n}',\n",
       "   'mdc': {'Repo': 'Demo',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172'},\n",
       "   'timestamp': '2025-03-18T15:42:19.638'},\n",
       "  {'level': 'INFO',\n",
       "   'message': 'engine results: 1 rules executed',\n",
       "   'mdc': {'Repo': 'Demo',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172'},\n",
       "   'timestamp': '2025-03-18T15:42:19.638'},\n",
       "  {'level': 'ERROR',\n",
       "   'message': '1 errors found',\n",
       "   'mdc': {'Repo': 'Demo',\n",
       "    'User-Uri': 'http://wistor.nl/generatedUser#userf5534225-42cf-4af7-86d3-ec63a0b0f8d1',\n",
       "    'Username': 'Demo',\n",
       "    'IP-Address': '82.172.172.172'},\n",
       "   'timestamp': '2025-03-18T15:42:19.638'}],\n",
       " 'success': False,\n",
       " 'errorMessage': 'rule execution error',\n",
       " 'errors': ['could not execute rule \\'ams_add_many_wkt\\'. sp error 22 . PREFIX geo: <http://www.w3.org/2003/01/geo/wgs84_pos#>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>PREFIX wistor: <http://wistor.nl>INSERT{  GRAPH <http://wistor.nl/ams/wkt>  {    ?uri geo:asWKT ?wkt;    \\\\t rdf:type  ?type  }}WHERE{  VALUES (?uri ?wkt ?type) { (<http://wistor.nl/some_generated_id_1> \\\\\"POINT(4.9 52.3)\\\\\"^^geo:wktLiteral) }}']}"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "ams",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
